html/comp-sci/lisp/definitions.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-04 Sun 18:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Definitions in Lisp</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Definitions in Lisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b7ffa8">1. Overview</a></li>
<li><a href="#orgd835d6c">2. Defun</a>
<ul>
<li><a href="#orgf06e6c3">2.1. SBCL</a></li>
<li><a href="#orga76dc39">2.2. ABCL</a></li>
</ul>
</li>
<li><a href="#orgc4e9ac4">3. Defgeneric</a>
<ul>
<li><a href="#org5d6fc40">3.1. SBCL</a></li>
<li><a href="#org31af693">3.2. ABCL</a></li>
<li><a href="#org7f8562b">3.3. CCL</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8b7ffa8" class="outline-2">
<h2 id="org8b7ffa8"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Common Lisp &#x2014; being a Lisp-2 &#x2014; has two namespaces for definitions:
one for functions, the other for values. How does this work? And how
does, say, <code>defgeneric</code> and <code>defmethod</code> work?
</p>
</div>
</div>

<div id="outline-container-orgd835d6c" class="outline-2">
<h2 id="orgd835d6c"><span class="section-number-2">2</span> Defun</h2>
<div class="outline-text-2" id="text-2">
<p>
Usually <code>defun</code> is a macro.
</p>
</div>

<div id="outline-container-orgf06e6c3" class="outline-3">
<h3 id="orgf06e6c3"><span class="section-number-3">2.1</span> SBCL</h3>
<div class="outline-text-3" id="text-2-1">
<p>
As I understand it, SBCL's implementation is a <a href="https://github.com/sbcl/sbcl/blob/sbcl-2.0.11/src/code/macros.lisp#L151-L163">macro</a> which calls <a href="https://github.com/sbcl/sbcl/blob/sbcl-2.0.11/src/code/target-misc.lisp#L164-L183">%defun</a>.
It amounts to <code>(setf (fdefinition name) def)</code> as one might expect.
</p>
</div>
</div>

<div id="outline-container-orga76dc39" class="outline-3">
<h3 id="orga76dc39"><span class="section-number-3">2.2</span> ABCL</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Armed Bear CL has a primitive <a href="https://github.com/armedbear/abcl/blob/084f0cb28a80a9040bec3927b8a167190fd38d38/src/org/armedbear/lisp/Primitives.java#L1770-L1795">%defun</a> Java class.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc4e9ac4" class="outline-2">
<h2 id="orgc4e9ac4"><span class="section-number-2">3</span> Defgeneric</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5d6fc40" class="outline-3">
<h3 id="org5d6fc40"><span class="section-number-3">3.1</span> SBCL</h3>
<div class="outline-text-3" id="text-3-1">
<p>
SBCL uses a rather contrived <a href="https://github.com/sbcl/sbcl/blob/sbcl-2.0.11/src/pcl/boot.lisp#L251-L342">macro</a> roughly 90 lines long.
It boils down to delegating the binding to <a href="https://github.com/sbcl/sbcl/blob/sbcl-2.0.11/src/pcl/boot.lisp#L1944-L1955">ensure-generic-function</a>.
If we call <code>defgeneric</code> on an existing function, it attempts to redefine
that function as a generic by clearing the existing definition and
continuing on as if there were no definition; otherwise, it just
calls <a href="https://github.com/sbcl/sbcl/blob/sbcl-2.0.11/src/pcl/boot.lisp#L2288-L2313">ensure-generic-function-using-class</a> (<a href="http://clhs.lisp.se/Body/f_ensure.htm#ensure-generic-function">CLHS</a> for <code>ensure-generic-function</code>). This then
<a href="https://github.com/sbcl/sbcl/blob/sbcl-2.0.11/src/pcl/braid.lisp#L54-L79">amounts to</a> <code>(setf (%funcallable-instance-fun name) ...)</code>.
</p>
</div>
</div>

<div id="outline-container-org31af693" class="outline-3">
<h3 id="org31af693"><span class="section-number-3">3.2</span> ABCL</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Armed Bear uses a <a href="https://github.com/armedbear/abcl/blob/084f0cb28a80a9040bec3927b8a167190fd38d38/src/org/armedbear/lisp/clos.lisp#L1687-L1729">macro</a>. It delegates to <code>%defgeneric</code> (<a href="https://github.com/armedbear/abcl/blob/084f0cb28a80a9040bec3927b8a167190fd38d38/src/org/armedbear/lisp/clos.lisp#L1786-L1802">L1786-L1802</a>).
which is a wrapper around <code>ensure-generic-function</code> (<a href="http://clhs.lisp.se/Body/f_ensure.htm#ensure-generic-function">CLHS</a>, <a href="https://github.com/armedbear/abcl/blob/084f0cb28a80a9040bec3927b8a167190fd38d38/src/org/armedbear/lisp/clos.lisp#L1807-L1864">implementation</a>).
</p>
</div>
</div>

<div id="outline-container-org7f8562b" class="outline-3">
<h3 id="org7f8562b"><span class="section-number-3">3.3</span> CCL</h3>
<div class="outline-text-3" id="text-3-3">
<p>
CCL has a <a href="https://github.com/Clozure/ccl/blob/v1.12/lib/macros.lisp#L2152-L2167">macro</a> defining <code>defgeneric</code>. Like ABCL, it delegates to
<a href="https://github.com/Clozure/ccl/blob/v1.12/level-1/l1-clos-boot.lisp#L3782-L3801">%defgeneric</a> which is a wrapper around <a href="https://github.com/Clozure/ccl/blob/v1.12/level-1/l1-clos-boot.lisp#L644-L651">ensure-generic-function</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2020-12-27 Sun 10:58.</p>
</div>
</body>
</html>